app/controllers/meets_controller.rb

  def index
    @meets = Meet.all
---
SELECT "meets".* FROM "meets"

  def create
    @meet = Meet.new(meet_params)

    respond_to do |format|
      if @meet.save
---
INSERT INTO "meets" ("created_at", "meeting", "name", "status", "subject", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2015-08-07 02:03:55.234375"], ["meeting", "2015-08-07"], ["name", ""], ["status", "f"], ["subject", ""], ["updated_at", "2015-08-07 02:03:55.234375"]]

    def set_meet
      @meet = Meet.find(params[:id])
---
SELECT  "meets".* FROM "meets"  WHERE "meets"."id" = ? LIMIT 1  [["id", 1]]