app/controllers/public_posts_controller.rb

SELECT  "categories".* FROM "categories"  WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
---
  def posts_category
    @category = Category.find(params[:id])